# 코딩테스트 연습>코딩테스트 입문>머쓱이보다 키 큰 사람

"""
머쓱이는 학교에서 키 순으로 줄을 설 때 몇 번째로 서야 하는지 궁금해졌습니다. 
머쓱이네 반 친구들의 키가 담긴 정수 배열 array와 
머쓱이의 키 height가 매개변수로 주어질 때, 
머쓱이보다 키 큰 사람 수를 return 하도록 solution 함수를 완성해보세요.

 제한사항
1 ≤ array의 길이 ≤ 100
1 ≤ height ≤ 200
1 ≤ array의 원소 ≤ 200

 입출력 예
array	                height	result
[149, 180, 192, 170]	167	    3
[180, 120, 140]	        190	    0
149, 180, 192, 170 중 머쓱이보다 키가 큰 사람은 180, 192, 170으로 세 명입니다.
"""
def solution(array, height):
    answer = n*(2**t)
    return answer

"""
힌트 1: 증식 규칙 이해하기
세균은 1시간마다 두 배가 되므로, 1시간 후에는 원래 수의 2배,
2시간 후에는 2배의 2배, 즉 2의 2제곱배,
t시간 후에는 2의 t제곱배가 됩니다.
n * (2 ** t)
"""

#다른풀이
